[{
        "name": "Butter Chicken",
        "ingredients": [
            "1 lb boneless chicken, cut into bite-sized pieces",
            "2 tbsp ghee or butter",
            "1 onion, chopped",
            "2 garlic cloves, minced",
            "1 tbsp grated ginger",
            "1 tsp ground cumin",
            "1 tsp paprika",
            "1/2 tsp turmeric",
            "1/2 tsp cayenne pepper",
            "1 cup tomato puree",
            "1/2 cup heavy cream",
            "1/4 cup chopped cilantro",
            "Salt, to taste"
        ],
        "instructions": [
            "In a large skillet, heat ghee or butter over medium heat.",
            "Add onions, garlic, and ginger and sauté until onions are translucent.",
            "Add chicken and cook until browned on all sides, about 5 minutes.",
            "Add cumin, paprika, turmeric, and cayenne pepper and cook for 1 minute.",
            "Add tomato puree and simmer for 15-20 minutes, until chicken is cooked through.",
            "Stir in heavy cream and cilantro and cook for 5 minutes more.",
            "Season with salt to taste and serve with rice or naan bread."
        ]
    },
    {
        "name": "Biryani",
        "ingredients": [
            "2 cups basmati rice",
            "4 cups water",
            "1 lb chicken, cut into bite-sized pieces",
            "1 onion, sliced",
            "2 garlic cloves, minced",
            "1 tbsp grated ginger",
            "1/2 cup yogurt",
            "2 tbsp ghee or butter",
            "2 tbsp biryani masala",
            "1/2 tsp turmeric",
            "1/2 tsp cayenne pepper",
            "1/4 cup chopped cilantro",
            "Salt, to taste"
        ],
        "instructions": [
            "Rinse rice in cold water and soak for 30 minutes.",
            "In a large pot, bring 4 cups of water to a boil and add rice.",
            "Cook for 10 minutes or until rice is partially cooked.",
            "Drain rice and set aside.",
            "In a separate pan, heat ghee or butter over medium heat.",
            "Add onions, garlic, and ginger and sauté until onions are translucent.",
            "Add chicken and cook until browned on all sides, about 5 minutes.",
            "Add biryani masala, turmeric, and cayenne pepper and cook for 1 minute.",
            "Add yogurt and stir until well combined.",
            "In a large pot, layer rice and chicken mixture, starting with rice and ending with rice.",
            "Cover and cook over low heat for 20-25 minutes or until rice is fully cooked.",
            "Garnish with chopped cilantro and serve with raita and papadums."
        ]
    },
    {
        "name": "Paneer Tikka Masala",
        "ingredients": [
            "300g paneer, cubed",
            "1 onion, finely chopped",
            "1 capsicum, diced",
            "1 tomato, pureed",
            "1 tsp ginger paste",
            "1 tsp garlic paste",
            "1 tsp cumin powder",
            "1 tsp coriander powder",
            "1 tsp garam masala",
            "1/2 tsp red chilli powder",
            "1/2 tsp turmeric powder",
            "1/2 cup cream",
            "2 tbsp oil",
            "Salt to taste"
        ],
        "instructions": [
            "In a mixing bowl, add cubed paneer, diced capsicum, and chopped onion. Mix well and set aside for 10 minutes.",
            "In a separate bowl, mix together ginger paste, garlic paste, cumin powder, coriander powder, garam masala, red chilli powder, turmeric powder, and salt.",
            "Add the spice mix to the paneer mixture and mix well.",
            "Heat oil in a pan and add the paneer mixture. Cook for 5-6 minutes, stirring occasionally.",
            "Add pureed tomato and cook for another 2-3 minutes.",
            "Add cream and mix well. Cook for 1-2 minutes and remove from heat.",
            "Garnish with coriander leaves and serve hot with naan or rice."
        ]
    },
    {
        "name": "Chole Bhature",
        "ingredients": [
            "1 cup chickpeas, soaked overnight",
            "2 onions, finely chopped",
            "2 tomatoes, finely chopped",
            "1 tsp ginger paste",
            "1 tsp garlic paste",
            "1 tsp cumin powder",
            "1 tsp coriander powder",
            "1 tsp garam masala",
            "1/2 tsp red chilli powder",
            "1/2 tsp turmeric powder",
            "2 tbsp oil",
            "Salt to taste",
            "For Bhature:",
            "2 cups all-purpose flour",
            "1/2 tsp baking powder",
            "1/2 tsp salt",
            "1/2 cup curd",
            "Oil for frying"
        ],
        "instructions": [
            "In a pressure cooker, cook soaked chickpeas with 2 cups of water and salt until soft. Drain and set aside.",
            "In a pan, heat oil and add chopped onions. Cook until golden brown.",
            "Add ginger paste and garlic paste. Cook for 1-2 minutes.",
            "Add chopped tomatoes and cook until they become soft and mushy.",
            "Add cumin powder, coriander powder, garam masala, red chilli powder, turmeric powder, and salt. Mix well and cook for 2-3 minutes.",
            "Add cooked chickpeas and mix well. Add water if needed and simmer for 10-15 minutes.",
            "For Bhature, in a mixing bowl, combine all-purpose flour, baking powder, and salt. Mix well.",
            "Add curd and knead the dough until it becomes soft and pliable.",
            "Cover the dough and let it rest for 30 minutes.",
            "Make small balls from the dough and roll them into circles.",
            "Heat oil in a frying pan and deep fry the bhature until golden brown.",
            "Serve hot with chole and sliced onion."
        ]
    },
    {
        "name": "Dosa",
        "ingredients": [
            "1 cup rice",
            "1/2 cup urad dal",
            "1/4 tsp fenugreek seeds",
            "1/2 tsp salt",
            "Water, as needed",
            "Oil or ghee, for cooking",
            "Chutney and sambar, for serving"
        ],
        "instructions": [
            "Rinse the rice, urad dal, and fenugreek seeds in water, and soak them in water for at least 4 hours or overnight.",
            "Drain the water from the soaked",
            "ingredients, and grind them in a blender or wet grinder to a smooth batter.",
            "Transfer the batter to a bowl, and add salt and water as needed to get a thin pouring consistency.",
            "Cover the bowl with a lid, and let the batter ferment in a warm place for 6-8 hours or overnight.",
            "When ready to make dosa, heat a non-stick skillet or griddle over medium heat, and grease it lightly with oil or ghee.",
            "Pour a ladleful of batter onto the center of the skillet, and spread it in a circular motion to make a thin crepe.",
            "Drizzle a few drops of oil or ghee around the edges of the dosa, and cook it until the bottom turns golden and crispy.",
            "Flip the dosa, and cook the other side until it turns lightly golden and crispy as well.",
            "Serve hot with chutney and sambar."
        ]
    },
    {
        "name": "Idli",
        "ingredients": [
            "1 cup urad dal",
            "2 cups idli rice",
            "1/2 tsp fenugreek seeds",
            "Salt, to taste",
            "Water, as needed",
            "Oil or ghee, for greasing",
            "Chutney and sambar, for serving"
        ],
        "instructions": [
            "Rinse the urad dal and fenugreek seeds in water, and soak them in water for at least 4 hours or overnight.",
            "Rinse the idli rice in water, and soak it in water for at least 4 hours or overnight.",
            "Drain the water from the soaked urad dal and fenugreek seeds, and grind them in a blender or wet grinder to a smooth batter, adding water as needed.",
            "Transfer the batter to a bowl, and set it aside.",
            "Drain the water from the soaked idli rice, and grind it in a blender or wet grinder to a slightly coarse texture, adding water as needed.",
            "Transfer the rice batter to the bowl with the urad dal batter, and mix well.",
            "Add salt to taste, and mix well again.",
            "Cover the bowl with a lid, and let the batter ferment in a warm place for 6-8 hours or overnight.",
            "When ready to make idli, grease the idli plates with oil or ghee.",
            "Pour a ladleful of batter into each idli mold, and steam them in a steamer for 10-12 minutes, or until a toothpick inserted into the center of an idli comes out clean.",
            "Remove the idli plates from the steamer, and let them cool for a few minutes.",
            "Remove the idlis from the molds using a spoon or knife, and serve hot with chutney and sambar."
        ]
    },
    {
        "name": "Samosa",
        "ingredients": [
            "1 cup all-purpose flour",
            "2 tablespoons vegetable oil",
            "1/2 teaspoon salt",
            "1/4 cup water",
            "1 potato, boiled and mashed",
            "1/2 cup green peas, boiled and mashed",
            "1 tablespoon oil",
            "1/2 teaspoon cumin seeds",
            "1/2 teaspoon fennel seeds",
            "1/2 teaspoon coriander powder",
            "1/2 teaspoon cumin powder",
            "1/2 teaspoon garam masala",
            "1/2 teaspoon amchur (dry mango) powder",
            "1/2 teaspoon salt",
            "1/4 teaspoon red chili powder",
            "2 tablespoons chopped fresh coriander leaves",
            "Oil for deep-frying"
        ],
        "instructions": [
            "In a bowl, combine the flour, oil, and salt. Add water gradually and knead into a smooth dough. Cover and set aside for 30 minutes.",
            "In a pan, heat 1 tablespoon of oil. Add cumin seeds and fennel seeds and fry until fragrant. Add coriander powder, cumin powder, garam masala, amchur powder, salt, and red chili powder. Mix well.",
            "Add mashed potato, peas, and chopped coriander leaves. Mix well and cook for 2-3 minutes. Remove from heat and let it cool.",
            "Divide the dough into small balls. Roll out each ball into a circle and cut it in half. Take one half and form a cone by bringing the two edges together and sealing the third side. Fill the cone with the potato and peas mixture and seal the open end.",
            "Heat oil in a deep frying pan. Fry the samosas until golden brown and crisp. Drain on paper towels and serve hot with chutney."
        ]
    },
    {
        "name": "Vada Pav",
        "ingredients": [
            "4 large potatoes, boiled and mashed",
            "1 teaspoon mustard seeds",
            "1/2 teaspoon cumin seeds",
            "1/4 teaspoon asafetida (hing)",
            "1/2 teaspoon turmeric powder",
            "1/2 teaspoon red chili powder",
            "1/2 teaspoon garam masala",
            "1 tablespoon oil",
            "Salt to taste",
            "8 pav (dinner rolls), split and lightly toasted",
            "Tamarind chutney",
            "Garlic chutney",
            "Chopped coriander leaves for garnish",
            "Oil for deep-frying"
        ],
        "instructions": [
            "In a pan, heat 1 tablespoon of oil. Add mustard seeds, cumin seeds, and asafetida. Let it splutter.",
            "Add turmeric powder, red chili powder, garam masala, and salt. Mix well.",
            "Add mashed potatoes and mix well. Cook for 2-3 minutes.",
            "Divide the mixture into 8 equal portions and shape them into patties. Heat oil in a deep frying pan and fry the patties until golden brown and crisp. Drain on paper towels.",
            "Take the lightly toasted pav and spread tamarind chutney and garlic chutney on the inside of each half.",
            "Place a potato patty in between the two halves of the pav. Garnish with chopped coriander leaves and serve hot."
        ]
    },
    {
        "name": "Aloo Gobi",
        "ingredients": [
            "1 small cauliflower, cut into florets",
            "2 medium potatoes, peeled and cubed",
            "1 medium onion, chopped",
            "2 cloves garlic, minced",
            "1 tablespoon ginger, grated",
            "1 green chili, chopped",
            "1/2 teaspoon cumin seeds",
            "1/2 teaspoon turmeric powder",
            "1 teaspoon coriander powder",
            "1/2 teaspoon cumin powder",
            "1/2 teaspoon red chili powder",
            "1/2 teaspoon garam masala",
            "Salt to taste",
            "2 tablespoons oil",
            "1 tablespoon chopped fresh cilantro"
        ],
        "instructions": [
            "Heat oil in a pan and add cumin seeds.",
            "Once the cumin seeds splutter, add chopped onion, minced garlic, grated ginger, and chopped green chili.",
            "Sauté until onions are translucent.",
            "Add turmeric powder, coriander powder, cumin powder, red chili powder, and garam masala.",
            "Mix well and sauté for a minute.",
            "Add cubed potatoes and cauliflower florets.",
            "Mix well and cook covered on medium heat until the vegetables are tender.",
            "Stir occasionally to prevent sticking.",
            "Add salt to taste and mix well.",
            "Garnish with chopped fresh cilantro and serve hot."
        ]
    },
    {
        "name": "Chicken Tikka",
        "ingredients": [
            "1 lb boneless, skinless chicken breasts, cut into bite-sized pieces",
            "1/2 cup plain yogurt",
            "1 tablespoon ginger paste",
            "1 tablespoon garlic paste",
            "1 tablespoon lemon juice",
            "1/2 teaspoon turmeric powder",
            "1/2 teaspoon cumin powder",
            "1/2 teaspoon coriander powder",
            "1/2 teaspoon paprika",
            "1/4 teaspoon cayenne pepper",
            "1/4 teaspoon garam masala",
            "Salt to taste",
            "2 tablespoons oil",
            "Skewers"
        ],
        "instructions": [
            "Combine yogurt, ginger paste, garlic paste, lemon juice, turmeric powder, cumin powder, coriander powder, paprika, cayenne pepper, garam masala, and salt in a bowl.",
            "Mix well to make the marinade.",
            "Add chicken pieces and coat them well with the marinade.",
            "Cover and refrigerate for at least 1 hour or overnight.",
            "Soak skewers in water for 30 minutes.",
            "Preheat the oven to 400°F.",
            "Thread the marinated chicken pieces onto skewers.",
            "Brush with oil and place them on a baking sheet lined with foil.",
            "Bake for 15-20 minutes or until the chicken is cooked through, turning the skewers once halfway through cooking.",
            "Remove from the oven and let it rest for a few minutes.",
            "Serve hot with mint chutney or your favorite sauce."
        ]
    }
]